---
kind: type
id: T:Autodesk.Revit.DB.Leader
source: html/66228564-d8b8-fc81-454c-e175528f7188.htm
---
# Autodesk.Revit.DB.Leader

A leader object that can be attached to annotation elements such as text notes.

## Syntax (C#)
```csharp
public class Leader : APIObject
```

## Remarks
For information on how to attach or get leaders to/from a text annotation
 refer to corresponding methods of TextNote class.